Repository: chocoford/ExcalidrawZ
Catalog: ExcalidrawZ/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, nl, pl, pt, ru, th, tr, vi, zh_hans, zh_hant

# settingsAIMCPServiceModeBasicHelp
source: Matches the excalidraw-mcp tool set: read the guide, create a view, and exchange MCP checkpoints.
ar: يتطابق مع مجموعة أدوات excalidraw-mcp: اقرأ الدليل، قم بإنشاء عرض، وتبادل نقاط التفتيش MCP.
de: Entspricht dem excalidraw-mcp-Toolset: Lesen Sie den Leitfaden, erstellen Sie eine Ansicht und tauschen Sie MCP-Checkpoints aus.
es: Coincide con el conjunto de herramientas excalidraw-mcp: lee la guía, crea una vista e intercambia puntos de control MCP.
fr: Correspond à l'ensemble d'outils excalidraw-mcp : lisez le guide, créez une vue et échangez des points de contrôle MCP.
hi: excalidraw-mcp टूल सेट से मेल खाता है: गाइड को पढ़ें, एक दृश्य बनाएं, और MCP चेकपॉइंट्स का आदान-प्रदान करें।
it: Corrisponde al set di strumenti di excalidraw-mcp: leggi la guida, crea una vista e scambia i checkpoint MCP.
ja: excalidraw-mcpツールセットに合わせています: ガイドを読み、ビューを作成し、MCPチェックポイントを交換します。
ko: excalidraw-mcp 도구 세트와 일치합니다: 가이드를 읽고, 뷰를 만들고, MCP 체크포인트를 교환하십시오.
nl: Komt overeen met de excalidraw-mcp toolset: lees de handleiding, maak een weergave en wissel MCP-controlepunten uit.
pl: Zgadza się z zestawem narzędzi excalidraw-mcp: przeczytaj przewodnik, stwórz widok i wymień punkty kontrolne MCP.
pt: Correspondências ao conjunto de ferramentas excalidraw-mcp: leia o guia, crie uma visualização e troque pontos de verificação MCP.
ru: Совпадает с набором инструментов excalidraw-mcp: прочитайте руководство, создайте представление и обменивайтесь контрольными точками MCP.
th: ตรงกับเครื่องมือ excalidraw-mcp: อ่านคู่มือ สร้างมุมมอง และแลกเปลี่ยนเช็คพอยต์ MCP
tr: excalidraw-mcp araç setiyle eşleşir: kılavuzu okuyun, bir görünüm oluşturun ve MCP kontrol noktalarını değiştirin.
vi: Khớp với bộ công cụ excalidraw-mcp: đọc hướng dẫn, tạo một chế độ xem và trao đổi các checkpoint MCP.
zh_hans: 与 excalidraw-mcp 工具集一致：读取指南、创建视图，并交换 MCP 检查点。
zh_hant: 與 excalidraw-mcp 工具集一致：讀取指南、建立視圖，並交換 MCP 檢查點。

# settingsAIMCPServiceModeBasicTitle
source: Basic
ar: أساسي
de: Grundlegend
es: Básico
fr: Basique
hi: बुनियादी
it: Base
ja: 基本
ko: 기본
nl: Basis
pl: Podstawowy
pt: Básico
ru: Базовый
th: เบื้องต้น
tr: Temel
vi: Cơ bản
zh_hans: 基本
zh_hant: 基本

# settingsAIMCPServiceModeComparisonBasicBestFor
source: Best for clients that already support excalidraw-mcp and only need basic canvas generation.
ar: يحافظ على توافق قريب مع العملاء الذين يدعمون بالفعل excalidraw-mcp.
de: Hält enge Kompatibilität mit Klienten, die bereits excalidraw-mcp unterstützen.
es: Mantiene una compatibilidad cercana con clientes que ya soportan excalidraw-mcp.
fr: Maintient une compatibilité proche avec les clients qui prennent déjà en charge excalidraw-mcp.
hi: उन ग्राहकों के साथ निकट संगतता बनाए रखता है जो पहले से excalidraw-mcp का समर्थन करते हैं।
it: Mantiene una compatibilità elevata con i clienti che supportano già excalidraw-mcp.
ja: excalidraw-mcpをすでにサポートしているクライアントとの互換性を保持します。
ko: 이미 excalidraw-mcp를 지원하는 클라이언트와의 호환성을 유지합니다.
nl: Behoudt nauwe compatibiliteit met cliënten die al excalidraw-mcp ondersteunen.
pl: Utrzymuje bliską kompatybilność z klientami, którzy już wspierają excalidraw-mcp.
pt: Mantém compatibilidade próxima com clientes que já suportam excalidraw-mcp.
ru: Поддерживает близкую совместимость с клиентами, которые уже поддерживают excalidraw-mcp.
th: รักษาความเข้ากันได้ใกล้เคียงกับลูกค้าที่รองรับ excalidraw-mcp อยู่แล้ว
tr: Excalidraw-mcp'yi zaten destekleyen istemcilerle yakın uyumluluğu korur.
vi: Giữ tính tương thích gần gũi với các khách hàng đã hỗ trợ excalidraw-mcp.
zh_hans: 适合已经支持 excalidraw-mcp、且只需要基础画布生成的客户端。
zh_hant: 適合已支援 excalidraw-mcp，且只需要基礎畫布生成的客戶端。

# settingsAIMCPServiceModeComparisonBasicCanvasTools
source: Supports standard Excalidraw shapes, text, arrows, labels, colors, and camera framing.
ar: يرسم الأشكال والنصوص والأسهم والتسميات والألوان وإطار الكاميرا.
de: Zeichnet Formen, Text, Pfeile, Beschriftungen, Farben und Kamerarandbereiche.
es: Dibuja formas, texto, flechas, etiquetas, colores y encuadre de cámara.
fr: Dessine des formes, du texte, des flèches, des étiquettes, des couleurs et encadrements de caméra.
hi: आकृतियाँ, पाठ, तीर, लेबल, रंग और कैमरा फ्रेमिंग बनाता है।
it: Disegna forme, testo, frecce, etichette, colori e inquadrature della telecamera.
ja: 図形、テキスト、矢印、ラベル、色、カメラフレーミングを描画します。
ko: 도형, 텍스트, 화살표, 레이블, 색상 및 카메라 구성을 그립니다.
nl: Tekent vormen, tekst, pijlen, labels, kleuren en camerakaders.
pl: Rysuje kształty, tekst, strzałki, etykiety, kolory i kadrowanie kamery.
pt: Desenha formas, texto, setas, rótulos, cores e enquadramento da câmera.
ru: Рисует фигуры, текст, стрелки, метки, цвета и ракурсы камеры.
th: วาดรูปทรง ข้อความ ลูกศร ป้าย สี และการจัดกรอบกล้อง
tr: Şekiller, metin, oklar, etiketler, renkler ve kamera çerçevesi çizer.
vi: Vẽ hình dạng, văn bản, mũi tên, nhãn, màu sắc và khung hình camera.
zh_hans: 支持标准 Excalidraw 形状、文本、箭头、标签、颜色和相机构图。
zh_hant: 支援標準 Excalidraw 形狀、文字、箭頭、標籤、顏色和相機框架。

# settingsAIMCPServiceModeComparisonBasicDrawingFlow
source: Creates a complete Excalidraw scene from the elements sent by the MCP client.
ar: يخلق مشهد Excalidraw كامل من موجه.
de: Erstellt eine vollständige Excalidraw-Szene aus einer Eingabeaufforderung.
es: Crea una escena completa de Excalidraw a partir de un aviso.
fr: Crée une scène Excalidraw complète à partir d'une invite.
hi: प्रॉम्प्ट से एक संपूर्ण Excalidraw दृश्य बनाता है।
it: Crea una scena completa di Excalidraw da un prompt.
ja: プロンプトから完全なExcalidrawシーンを作成します。
ko: 프롬프트에서 완전한 Excalidraw 장면을 생성합니다.
nl: Maakt een complete Excalidraw-scène op basis van een prompt.
pl: Tworzy kompletną scenę Excalidraw z podanego promptu.
pt: Cria uma cena completa de Excalidraw a partir de um prompt.
ru: Создает полную сцену Excalidraw из запроса.
th: สร้างฉาก Excalidraw แบบเต็มจากคำสั่ง
tr: Bir istemden tam bir Excalidraw sahnesi oluşturur.
vi: Tạo ra một cảnh Excalidraw hoàn chỉnh từ một lời nhắc.
zh_hans: 根据 MCP 客户端发送的元素创建完整的 Excalidraw 场景。
zh_hant: 根據 MCP 客戶端傳送的元素建立完整的 Excalidraw 場景。

# settingsAIMCPServiceModeComparisonBasicHistory
source: Revises by sending another create_view payload or restoring MCP checkpoints; it does not edit existing files incrementally.
ar: يدعم المراجعات البسيطة من خلال نقاط التفتيش MCP.
de: Unterstützt einfache Revisionen durch MCP-Kontrollpunkte.
es: Admite revisiones simples a través de puntos de control de MCP.
fr: Supporte des révisions simples via des points de contrôle MCP.
hi: MCP चेकपॉइंट के माध्यम से सरल संशोधनों का समर्थन करता है।
it: Supporta revisioni semplici attraverso i checkpoint MCP.
ja: MCPチェックポイントを通じて簡単な修正をサポートします。
ko: MCP 체크포인트를 통해 간단한 수정 사항을 지원합니다.
nl: Ondersteunt eenvoudige revisies via MCP-controlepunten.
pl: Obsługuje proste rewizje przez punkty kontrolne MCP.
pt: Suporta revisões simples através de checagens do MCP.
ru: Поддерживает простые изменения через контрольные точки MCP.
th: รองรับการแก้ไขแบบง่ายผ่านจุดตรวจสอบ MCP
tr: MCP kontrol noktaları aracılığıyla basit revizyonları destekler.
vi: Hỗ trợ các sửa đổi đơn giản thông qua các điểm kiểm tra MCP.
zh_hans: 通过再次发送 create_view 内容或恢复 MCP 检查点来修订；不会增量编辑现有文件。
zh_hant: 透過再次傳送 create_view 內容或恢復 MCP 檢查點來修訂；不會增量編輯既有檔案。

# settingsAIMCPServiceModeComparisonOptimizedBestFor
source: Best when the client should work like an ExcalidrawZ-aware assistant, not just a diagram generator.
ar: أفضل عندما يجب أن يعمل العميل كمعاون على دراية بـ ExcalidrawZ، وليس فقط كمولد مخططات.
de: Am besten, wenn der Client wie ein ExcalidrawZ-bewusster Assistent arbeiten sollte und nicht nur als Diagrammgenerator.
es: Mejor cuando el cliente debe funcionar como un asistente consciente de ExcalidrawZ, no solo como un generador de diagramas.
fr: Meilleur lorsque le client doit fonctionner comme un assistant conscient d'ExcalidrawZ, et pas seulement comme un générateur de diagrammes.
hi: बेस्ट जब क्लाइंट को ExcalidrawZ-साक्षर सहायक की तरह काम करना चाहिए, न कि केवल एक आरेख जेनरेटर।
it: Ideale quando il client dovrebbe funzionare come un assistente consapevole di ExcalidrawZ, non solo come un generatore di diagrammi.
ja: クライアントが単なる図を生成するだけでなく、ExcalidrawZに対応したアシスタントのように動作すべき場合に最適です。
ko: 클라이언트가 단순한 다이어그램 생성기가 아니라 ExcalidrawZ 인식 도우미처럼 작동할 때 가장 좋습니다.
nl: Het beste wanneer de cliënt moet werken als een ExcalidrawZ-bewuste assistent, niet alleen als een diagramgenerator.
pl: Najlepsze, gdy klient powinien działać jak asystent świadomy ExcalidrawZ, a nie tylko generator diagramów.
pt: Melhor quando o cliente deve funcionar como um assistente ciente do ExcalidrawZ, não apenas como um gerador de diagramas.
ru: Лучше, когда клиент должен работать как ассистент, осведомленный о ExcalidrawZ, а не просто как генератор диаграмм.
th: ดีที่สุดเมื่อไคลเอนต์ควรทำงานเหมือนผู้ช่วยที่รับรู้ ExcalidrawZ ไม่ใช่แค่เครื่องสร้างภาพ
tr: İstemcinin yalnızca bir diyagram oluşturucu değil, ExcalidrawZ'yi bilen bir asistan gibi çalışması gerektiğinde en iyisidir.
vi: Tốt nhất khi client hoạt động như một trợ lý nhận thức ExcalidrawZ, không chỉ là một trình tạo sơ đồ.
zh_hans: 当客户端应该像 ExcalidrawZ 识别助手一样工作，而不仅仅是图表生成器时最佳。
zh_hant: 當客戶端應該像 ExcalidrawZ 知道的助手而不僅僅是圖表生成器時效果最佳。

# settingsAIMCPServiceModeComparisonOptimizedCanvasTools
source: Can inspect the rendered canvas, export files, change canvas preferences, navigate the view, use libraries, insert Mermaid, insert math, and patch elements.
ar: يمكنه فحص اللوحة المنبعثة، تصدير الملفات، تغيير تفضيلات اللوحة، التنقل في العرض، استخدام المكتبات، إدراج ميرميد، إدراج الرياضيات، وترقيع العناصر.
de: Kann die gerenderte Leinwand inspizieren, Dateien exportieren, Leinwandeinstellungen ändern, die Ansicht navigieren, Bibliotheken nutzen, Mermaid einfügen, Mathematik einfügen und Elemente patchen.
es: Puede inspeccionar el lienzo renderizado, exportar archivos, cambiar preferencias del lienzo, navegar por la vista, usar bibliotecas, insertar Mermaid, insertar matemáticas y parchear elementos.
fr: Peut inspecter le canevas rendu, exporter des fichiers, changer les préférences du canevas, naviguer dans la vue, utiliser des bibliothèques, insérer Mermaid, insérer des mathématiques et patcher des éléments.
hi: अभिव्यक्त किए गए कैनवास की जांच कर सकता है, फ़ाइलें निर्यात कर सकता है, कैनवास प्राथमिकताएँ बदल सकता है, दृश्य को नेविगेट कर सकता है, पुस्तकालयों का उपयोग कर सकता है, Mermaid डाल सकता है, गणित डाल सकता है, और तत्वों को पैच कर सकता है।
it: Può ispezionare la tela renderizzata, esportare file, modificare preferenze della tela, navigare nella vista, utilizzare librerie, inserire Mermaid, inserire matematica e patchare elementi.
ja: レンダリングされたキャンバスの検査、ファイルのエクスポート、キャンバスの設定の変更、ビューのナビゲート、ライブラリの使用、Mermaidの挿入、数学の挿入、要素のパッチなどが可能です。
ko: 렌더링된 캔버스를 검사하고 파일을 내보내며, 캔버스 기본 설정을 변경하고, 뷰를 탐색하고, 라이브러리를 사용하며, Mermaid를 삽입하고, 수학을 삽입하며, 요소를 패치할 수 있습니다.
nl: Kan het weergegeven canvas inspecteren, bestanden exporteren, canvasvoorkeuren wijzigen, de weergave navigeren, bibliotheken gebruiken, Mermaid invoegen, wiskunde invoegen en elementen patchen.
pl: Może przeglądać renderowany obszar roboczy, eksportować pliki, zmieniać preferencje obszaru roboczego, nawigować widokiem, korzystać z bibliotek, wstawiać Mermaid, wstawiać matematykę i patchować elementy.
pt: Pode inspecionar o canvas renderizado, exportar arquivos, alterar preferências do canvas, navegar na visualização, usar bibliotecas, inserir Mermaid, inserir matemática e corrigir elementos.
ru: Может инспектировать отрисованный холст, экспортировать файлы, изменять предпочтения холста, навигировать по виду, использовать библиотеки, вставлять Mermaid, вставлять математику и редактировать элементы.
th: สามารถตรวจสอบผืนผ้าใบที่เรนเดอร์ ส่งออกไฟล์ เปลี่ยนการตั้งค่าผืนผ้าใบ นำทางมุมมอง ใช้ไลบรารี แทรก Mermaid แทรกคณิตศาสตร์ และแพตช์องค์ประกอบ
tr: Oluşturulan kanvası inceleyebilir, dosyaları dışa aktarabilir, kanvas tercihlerini değiştirebilir, görünümü gezinebilir, kütüphaneleri kullanabilir, Mermaid ekleyebilir, matematik ekleyebilir ve öğeleri yamanız mümkündür.
vi: Có thể kiểm tra canvas đã được hiển thị, xuất tập tin, thay đổi sở thích canvas, điều hướng xem, sử dụng thư viện, chèn Mermaid, chèn toán học và vá các phần tử.
zh_hans: 可以检查渲染的画布，导出文件，更改画布偏好，导航视图，使用库，插入 Mermaid，插入数学，和修补元素。
zh_hant: 可以檢查渲染的畫布、導出檔案、改變畫布首選項、導航視圖、使用庫、插入 Mermaid、插入數學和補丁元素。

# settingsAIMCPServiceModeComparisonOptimizedDrawingFlow
source: Edits the active ExcalidrawZ file directly instead of only creating a generated view.
ar: يعدل ملف ExcalidrawZ النشط مباشرة بدلاً من إنشاء عرض مولد فقط.
de: Bearbeitet die aktive ExcalidrawZ-Datei direkt, anstatt nur eine generierte Ansicht zu erstellen.
es: Edita el archivo activo de ExcalidrawZ directamente en lugar de solo crear una vista generada.
fr: Modifie directement le fichier ExcalidrawZ actif au lieu de créer uniquement une vue générée.
hi: सिर्फ उत्पन्न दृश्य बनाने के बजाय सक्रिय ExcalidrawZ फ़ाइल को सीधे संपादित करता है।
it: Modifica direttamente il file ExcalidrawZ attivo invece di creare solo una vista generata.
ja: 生成されたビューを作成するだけでなく、アクティブなExcalidrawZファイルを直接編集します。
ko: 생성된 보기만 만드는 대신 활성 ExcalidrawZ 파일을 직접 편집합니다.
nl: Bewerkt het actieve ExcalidrawZ-bestand direct in plaats van alleen een gegenereerde weergave te maken.
pl: Edytuje aktywny plik ExcalidrawZ bezpośrednio zamiast tylko tworzenia wygenerowanego widoku.
pt: Edita o arquivo ativo do ExcalidrawZ diretamente em vez de apenas criar uma visualização gerada.
ru: Редактирует активный файл ExcalidrawZ напрямую, а не только создает сгенерированный вид.
th: แก้ไขไฟล์ ExcalidrawZ ที่เปิดใช้งานโดยตรงแทนที่จะเพียงสร้างมุมมองที่สร้างขึ้น
tr: Etkin ExcalidrawZ dosyasını doğrudan düzenler, yalnızca oluşturulmuş bir görünüm oluşturmakla kalmaz.
vi: Chỉnh sửa tệp ExcalidrawZ đang hoạt động trực tiếp thay vì chỉ tạo một chế độ xem được tạo ra.
zh_hans: 直接编辑活动的 ExcalidrawZ 文件，而不仅仅是创建生成的视图。
zh_hant: 直接編輯活動的 ExcalidrawZ 檔案，而不僅僅是創建生成視圖。

# settingsAIMCPServiceModeComparisonOptimizedFileAwareness
source: Can list, create, open, and confirm ExcalidrawZ files and authorized local files.
ar: يمكنه سرد وإنشاء وفتح وتأكيد ملفات ExcalidrawZ والملفات المحلية المعتمدة.
de: Kann ExcalidrawZ-Dateien und autorisierte lokale Dateien auflisten, erstellen, öffnen und bestätigen.
es: Puede listar, crear, abrir y confirmar archivos de ExcalidrawZ y archivos locales autorizados.
fr: Peut lister, créer, ouvrir et confirmer des fichiers ExcalidrawZ et des fichiers locaux autorisés.
hi: ExcalidrawZ फ़ाइलों और अधिकृत स्थानीय फ़ाइलों को सूचीबद्ध, बनाना, खोलना और पुष्टि कर सकता है।
it: Può elencare, creare, aprire e confermare file ExcalidrawZ e file locali autorizzati.
ja: ExcalidrawZファイルおよび認可されたローカルファイルをリスト、作成、オープン、および確認できます。
ko: ExcalidrawZ 파일 및 승인된 로컬 파일을 나열, 생성, 열고 확인할 수 있습니다.
nl: Kan ExcalidrawZ-bestanden en geautoriseerde lokale bestanden opsommen, maken, openen en bevestigen.
pl: Może wylistować, utworzyć, otworzyć i potwierdzić pliki ExcalidrawZ oraz autoryzowane pliki lokalne.
pt: Pode listar, criar, abrir e confirmar arquivos do ExcalidrawZ e arquivos locais autorizados.
ru: Может перечислять, создавать, открывать и подтверждать файлы ExcalidrawZ и авторизованные локальные файлы.
th: สามารถจัดรายการ สร้าง เปิด และยืนยันไฟล์ ExcalidrawZ และไฟล์โลคัลที่ได้รับอนุญาต
tr: ExcalidrawZ dosyalarını ve yetkilendirilmiş yerel dosyaları listeleyebilir, oluşturabilir, açabilir ve onaylayabilir.
vi: Có thể liệt kê, tạo, mở và xác nhận các tệp ExcalidrawZ và các tệp cục bộ được ủy quyền.
zh_hans: 可以列出、创建、打开和确认 ExcalidrawZ 文件及授权的本地文件。
zh_hant: 可以列出、創建、打開和確認 ExcalidrawZ 檔案和授權本地檔案。

# settingsAIMCPServiceModeComparisonOptimizedHistory
source: Records ExcalidrawZ File History around changes and can restore saved checkpoints.
ar: يسجل تاريخ ملف ExcalidrawZ حول التغييرات ويمكنه استعادة نقاط التفتيش المحفوظة.
de: Aufzeichnungen zur ExcalidrawZ-Dateiversionierung in Bezug auf Änderungen und kann gespeicherte Kontrollpunkte wiederherstellen.
es: Registra el historial de archivos de ExcalidrawZ en torno a los cambios y puede restaurar puntos de control guardados.
fr: Enregistre l'historique des fichiers ExcalidrawZ autour des changements et peut restaurer des points de contrôle enregistrés.
hi: बदलावों के चारों ओर ExcalidrawZ फ़ाइल इतिहास को रिकॉर्ड करता है और सहेजे गए चेकपॉइंट को पुनर्स्थापित कर सकता है।
it: Registra la cronologia del file ExcalidrawZ attorno ai cambiamenti e può ripristinare checkpoint salvati.
ja: 変更にあたるExcalidrawZファイルの履歴を記録し、保存されたチェックポイントを復元できます。
ko: 변경 사항 주위에 ExcalidrawZ 파일 히스토리를 기록하고 저장된 체크포인트를 복원할 수 있습니다.
nl: Registreert ExcalidrawZ-bestandgeschiedenis rond wijzigingen en kan opgeslagen controlepunten herstellen.
pl: Rejestruje historię plików ExcalidrawZ dotyczących zmian i może przywracać zapisane punkty kontrolne.
pt: Registra o histórico de arquivos do ExcalidrawZ em torno de mudanças e pode restaurar pontos de verificação salvos.
ru: Записывает историю файлов ExcalidrawZ вокруг изменений и может восстанавливать сохраненные контрольные точки.
th: บันทึกประวัติไฟล์ ExcalidrawZ รอบการเปลี่ยนแปลงและสามารถคืนค่าจุดตรวจสอบที่บันทึกไว้
tr: Değişiklikler etrafında ExcalidrawZ Dosya Geçmişini kaydeder ve kaydedilmiş kontrol noktalarını geri yükleyebilir.
vi: Ghi lại Lịch sử Tệp ExcalidrawZ xung quanh các thay đổi và có thể khôi phục các điểm kiểm tra đã lưu.
zh_hans: 记录关于更改的 ExcalidrawZ 文件历史，并可以恢复保存的检查点。
zh_hant: 在更改周圍記錄 ExcalidrawZ 檔案歷史並可以恢復已保存的檢查點。

# settingsAIMCPServiceModeFeatureBasicCompatibilityTitle
source: Client compatibility
ar: توافق العملاء
de: Kompatibilität der Clients
es: Compatibilidad del cliente
fr: Compatibilité des clients
hi: क्लाइंट संगतता
it: Compatibilità client
ja: クライアントの互換性
ko: 클라이언트 호환성
nl: Clientcompatibiliteit
pl: Kompatybilność klientów
pt: Compatibilidade do cliente
ru: Совместимость клиентов
th: ความเข้ากันได้ของลูกค้า
tr: İstemci uyumluluğu
vi: Tương thích khách hàng
zh_hans: 客户端兼容性
zh_hant: 客戶端相容性

# settingsAIMCPServiceModeFeatureBasicDrawingTitle
source: Standard drawing
ar: رسم القماش
de: Canvas-Zeichnung
es: Dibujo en el lienzo
fr: Dessin sur canvas
hi: कैनवास चित्रण
it: Disegno su canvas
ja: キャンバス描画
ko: 캔버스 드로잉
nl: Canvas tekenen
pl: Rysowanie na płótnie
pt: Desenho em canvas
ru: Рисование на холсте
th: การวาดบนผืนผ้าใบ
tr: Tuval çizimi
vi: Vẽ trên canvas
zh_hans: 标准绘制
zh_hant: 標準繪製

# settingsAIMCPServiceModeFeatureBasicFocusTitle
source: excalidraw-mcp tools
ar: أدوات excalidraw-mcp
de: excalidraw-mcp Werkzeuge
es: herramientas excalidraw-mcp
fr: outils excalidraw-mcp
hi: एक्स्कैलिड्रॉ-एमसीपी उपकरण
it: strumenti excalidraw-mcp
ja: excalidraw-mcpツール
ko: 엑스칼리드로우-MCP 도구
nl: excalidraw-mcp gereedschappen
pl: narzędzia excalidraw-mcp
pt: ferramentas excalidraw-mcp
ru: инструменты excalidraw-mcp
th: เครื่องมือ excalidraw-mcp
tr: excalidraw-mcp araçları
vi: công cụ excalidraw-mcp
zh_hans: excalidraw-mcp 工具集
zh_hant: excalidraw-mcp 工具集

# settingsAIMCPServiceModeFeatureBasicRevisionTitle
source: Checkpoint revisions
ar: مراجعات بسيطة
de: Einfache Überarbeitungen
es: Revisiones simples
fr: Révisions simples
hi: सरल संशोधन
it: Revisioni semplici
ja: シンプルなリビジョン
ko: 간단한 수정
nl: Eenvoudige revisies
pl: Proste rewizje
pt: Revisões simples
ru: Простые ревизии
th: การแก้ไขที่ง่าย
tr: Basit revizyonlar
vi: Sửa đổi đơn giản
zh_hans: 检查点修订
zh_hant: 檢查點修訂

# settingsAIMCPServiceModeFeatureBasicSceneTitle
source: Single scene output
ar: توليد المشهد
de: Szenengenerierung
es: Generación de escenas
fr: Génération de scènes
hi: दृश्य निर्माण
it: Generazione di scene
ja: シーン生成
ko: 장면 생성
nl: Scène generatie
pl: Generowanie scen
pt: Geração de cena
ru: Генерация сцен
th: การสร้างฉาก
tr: Sahne oluşturma
vi: Tạo cảnh
zh_hans: 单场景输出
zh_hant: 單場景輸出

# settingsAIMCPServiceModeFeatureOptimizedAppToolsTitle
source: App-level tools
ar: أدوات على مستوى التطبيق
de: App-Tools
es: Herramientas a nivel de aplicación
fr: Outils au niveau de l'application
hi: ऐप-स्तरीय उपकरण
it: Strumenti a livello di app
ja: アプリレベルのツール
ko: 앱 수준 도구
nl: App-niveau tools
pl: Narzędzia na poziomie aplikacji
pt: Ferramentas de nível de aplicativo
ru: Инструменты на уровне приложения
th: เครื่องมือระดับแอป
tr: Uygulama düzeyinde araçlar
vi: Công cụ cấp ứng dụng
zh_hans: 应用级工具
zh_hant: 應用級工具

# settingsAIMCPServiceModeFeatureOptimizedAssistantTitle
source: Assistant workflow
ar: تدفق عمل المساعد
de: Assistenten-Workflow
es: Flujo de trabajo del asistente
fr: Flux de travail de l'assistant
hi: सहायक कार्यप्रवाह
it: Flusso di lavoro dell'assistente
ja: アシスタントワークフロー
ko: 어시스턴트 워크플로
nl: Assistant werkstroom
pl: Przepływ pracy asystenta
pt: Fluxo de trabalho do assistente
ru: Рабочий процесс помощника
th: การทำงานของผู้ช่วย
tr: Asistan iş akışı
vi: Luồng công việc của trợ lý
zh_hans: 助手工作流程
zh_hant: 助手工作流程

# settingsAIMCPServiceModeFeatureOptimizedCrossFileBody
source: List, create, open, and switch between ExcalidrawZ files and authorized local files.
ar: قائمة، إنشاء، فتح، والتبديل بين ملفات ExcalidrawZ والملفات المحلية المصرح بها.
de: Liste erstellen, öffnen und zwischen ExcalidrawZ-Dateien und autorisierten lokalen Dateien wechseln.
es: Listar, crear, abrir y cambiar entre archivos de ExcalidrawZ y archivos locales autorizados.
fr: Lister, créer, ouvrir et basculer entre les fichiers ExcalidrawZ et les fichiers locaux autorisés.
hi: ExcalidrawZ फ़ाइलों और अधिकृत स्थानीय फ़ाइलों के बीच सूची, निर्माण, खोलें और स्विच करें।
it: Elenca, crea, apri e passa tra file ExcalidrawZ e file locali autorizzati.
ja: ExcalidrawZファイルと承認されたローカルファイルのリスト作成、オープン、切り替えを行います。
ko: ExcalidrawZ 파일 및 승인된 로컬 파일 간에 목록을 작성하고, 열고, 전환하세요.
nl: Lijst, maak, open en wissel tussen ExcalidrawZ-bestanden en geautoriseerde lokale bestanden.
pl: Lista, twórz, otwieraj i przełączaj się między plikami ExcalidrawZ oraz autoryzowanymi plikami lokalnymi.
pt: Liste, crie, abra e mude entre arquivos ExcalidrawZ e arquivos locais autorizados.
ru: Список, создание, открытие и переключение между файлами ExcalidrawZ и авторизованными локальными файлами.
th: รายการ สร้าง เปิด และสลับระหว่างไฟล์ ExcalidrawZ และไฟล์ในท้องถิ่นที่ได้รับอนุญาต
tr: ExcalidrawZ dosyaları ve yetkilendirilmiş yerel dosyalar arasında listeleme, oluşturma, açma ve geçiş yapma.
vi: Danh sách, tạo, mở và chuyển đổi giữa các tệp ExcalidrawZ và các tệp cục bộ được ủy quyền.
zh_hans: 列出、创建、打开并切换 ExcalidrawZ 文件和授权的本地文件。
zh_hant: 列出、創建、打開及切換 ExcalidrawZ 檔案和授權的本地檔案。

# settingsAIMCPServiceModeFeatureOptimizedCrossFileTitle
source: Cross-file editing
ar: تحرير عبر الملفات
de: Bearbeitung über Dateien hinweg
es: Edición entre archivos
fr: Édition inter-fichiers
hi: क्रॉस-फ़ाइल संपादन
it: Modifica tra file
ja: クロスファイル編集
ko: 크로스 파일 편집
nl: Cross-bestand bewerking
pl: Edycja między plikami
pt: Edição entre arquivos
ru: Редактирование между файлами
th: การแก้ไขข้ามไฟล์
tr: Dosyalar arası düzenleme
vi: Chỉnh sửa nhiều tệp
zh_hans: 跨文件编辑
zh_hant: 跨檔案編輯

# settingsAIMCPServiceModeFeatureOptimizedCurrentFileTitle
source: Current file editing
ar: تحرير الملف الحالي
de: Bearbeitung der aktuellen Datei
es: Edición del archivo actual
fr: Édition du fichier courant
hi: वर्तमान फाइल संपादन
it: Modifica del file corrente
ja: 現在のファイル編集
ko: 현재 파일 편집
nl: Huidige bestand bewerking
pl: Edycja bieżącego pliku
pt: Edição de arquivo atual
ru: Редактирование текущего файла
th: การแก้ไขไฟล์ปัจจุบัน
tr: Mevcut dosya düzenleme
vi: Chỉnh sửa tệp hiện tại
zh_hans: 当前文件编辑
zh_hant: 當前檔案編輯
